espressif/arduino-esp32/libraries/BLE/src/BLEUtils.cpp
  if (target == nullptr) {
    target = (uint8_t *)malloc(length * 2 + 1);
    if (target == nullptr) {
      log_e("buildHexData: malloc failed");
      return nullptr;
    }
  }
  char *startOfData = (char *)target;

  for (int i = 0; i < length; i++) {
    sprintf((char *)target, "%.2x", (char)source[i]);
    target += 2;
  }

  // Handle the special case where there was no data.
  if (length == 0) {
    *startOfData = 0;
  }

  return startOfData;
}  // buildHexData

/**
 * @brief Given an advertising data type, return a string representation of the type.
 *
 * For details see ...
 * https://www.bluetooth.com/specifications/assigned-numbers/generic-access-profile
 *
 * @return A string representation of the type.
 */
const char *BLEUtils::advDataTypeToString(uint8_t advType) {
  switch (advType) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG
    case ESP_BLE_AD_TYPE_FLAG:  // 0x01
      return "ESP_BLE_AD_TYPE_FLAG";
    case ESP_BLE_AD_TYPE_16SRV_PART:  // 0x02
      return "ESP_BLE_AD_TYPE_16SRV_PART";
    case ESP_BLE_AD_TYPE_16SRV_CMPL:  // 0x03
      return "ESP_BLE_AD_TYPE_16SRV_CMPL";
    case ESP_BLE_AD_TYPE_32SRV_PART:  // 0x04
      return "ESP_BLE_AD_TYPE_32SRV_PART";
    case ESP_BLE_AD_TYPE_32SRV_CMPL:  // 0x05
      return "ESP_BLE_AD_TYPE_32SRV_CMPL";
    case ESP_BLE_AD_TYPE_128SRV_PART:  // 0x06
      return "ESP_BLE_AD_TYPE_128SRV_PART";
    case ESP_BLE_AD_TYPE_128SRV_CMPL:  // 0x07
      return "ESP_BLE_AD_TYPE_128SRV_CMPL";
    case ESP_BLE_AD_TYPE_NAME_SHORT:  // 0x08
      return "ESP_BLE_AD_TYPE_NAME_SHORT";
    case ESP_BLE_AD_TYPE_NAME_CMPL:  // 0x09
      return "ESP_BLE_AD_TYPE_NAME_CMPL";
    case ESP_BLE_AD_TYPE_TX_PWR:  // 0x0a
      return "ESP_BLE_AD_TYPE_TX_PWR";
    case ESP_BLE_AD_TYPE_DEV_CLASS:  // 0x0b
      return "ESP_BLE_AD_TYPE_DEV_CLASS";
    case ESP_BLE_AD_TYPE_SM_TK:  // 0x10
      return "ESP_BLE_AD_TYPE_SM_TK";
    case ESP_BLE_AD_TYPE_SM_OOB_FLAG:  // 0x11
      return "ESP_BLE_AD_TYPE_SM_OOB_FLAG";
    case ESP_BLE_AD_TYPE_INT_RANGE:  // 0x12
      return "ESP_BLE_AD_TYPE_INT_RANGE";
    case ESP_BLE_AD_TYPE_SOL_SRV_UUID:  // 0x14
      return "ESP_BLE_AD_TYPE_SOL_SRV_UUID";
    case ESP_BLE_AD_TYPE_128SOL_SRV_UUID:  // 0x15
      return "ESP_BLE_AD_TYPE_128SOL_SRV_UUID";
    case ESP_BLE_AD_TYPE_SERVICE_DATA:  // 0x16
      return "ESP_BLE_AD_TYPE_SERVICE_DATA";
    case ESP_BLE_AD_TYPE_PUBLIC_TARGET:  // 0x17
      return "ESP_BLE_AD_TYPE_PUBLIC_TARGET";
    case ESP_BLE_AD_TYPE_RANDOM_TARGET:  // 0x18
      return "ESP_BLE_AD_TYPE_RANDOM_TARGET";
    case ESP_BLE_AD_TYPE_APPEARANCE:  // 0x19
      return "ESP_BLE_AD_TYPE_APPEARANCE";
    case ESP_BLE_AD_TYPE_ADV_INT:  // 0x1a
      return "ESP_BLE_AD_TYPE_ADV_INT";
    case ESP_BLE_AD_TYPE_32SOL_SRV_UUID:  // 0x1f
      return "ESP_BLE_AD_TYPE_32SOL_SRV_UUID";
    case ESP_BLE_AD_TYPE_32SERVICE_DATA:  // 0x20
      return "ESP_BLE_AD_TYPE_32SERVICE_DATA";
    case ESP_BLE_AD_TYPE_128SERVICE_DATA:  // 0x21
      return "ESP_BLE_AD_TYPE_128SERVICE_DATA";
    case ESP_BLE_AD_MANUFACTURER_SPECIFIC_TYPE:  // 0xff
      return "ESP_BLE_AD_MANUFACTURER_SPECIFIC_TYPE";
#endif
    default: log_v(" adv data type: 0x%x", advType); return "";
  }  // End switch
}  // advDataTypeToString

/*****************************************************************************
 *                            Bluedroid functions                            *
 *****************************************************************************/

#if defined(CONFIG_BLUEDROID_ENABLED)

/**
 * @brief Convert characteristic properties into a string representation.
 * @param [in] prop Characteristic properties.
 * @return A string representation of characteristic properties.
 */
String BLEUtils::characteristicPropertiesToString(uint8_t prop) {
  String res = "broadcast: ";
  res += ((prop & ESP_GATT_CHAR_PROP_BIT_BROADCAST) ? "1" : "0");
  res += ", read: ";
  res += ((prop & ESP_GATT_CHAR_PROP_BIT_READ) ? "1" : "0");
  res += ", write_nr: ";
  res += ((prop & ESP_GATT_CHAR_PROP_BIT_WRITE_NR) ? "1" : "0");
  res += ", write: ";
  res += ((prop & ESP_GATT_CHAR_PROP_BIT_WRITE) ? "1" : "0");
  res += ", notify: ";
  res += ((prop & ESP_GATT_CHAR_PROP_BIT_NOTIFY) ? "1" : "0");
  res += ", indicate: ";
  res += ((prop & ESP_GATT_CHAR_PROP_BIT_INDICATE) ? "1" : "0");
  res += ", auth: ";
  res += ((prop & ESP_GATT_CHAR_PROP_BIT_AUTH) ? "1" : "0");
  return res;
}  // characteristicPropertiesToString

/**
 * @brief Build a printable string of memory range.
 * Create a string representation of a piece of memory. Only printable characters will be included
 * while those that are not printable will be replaced with '.'.
 * @param [in] source Start of memory.
 * @param [in] length Length of memory.
 * @return A string representation of a piece of memory.
 */
String BLEUtils::buildPrintData(uint8_t *source, size_t length) {
  String res;
  for (int i = 0; i < length; i++) {
    char c = *source;
    res += (isprint(c) ? c : '.');
    source++;
  }
  return res;
}  // buildPrintData

/**
 * @brief Convert an esp_gatt_id_t to a string.
 */
static String gattIdToString(esp_gatt_id_t gattId) {
  String res = "uuid: " + BLEUUID(gattId.uuid).toString() + ", inst_id: ";
  char val[8];
  snprintf(val, sizeof(val), "%d", (int)gattId.inst_id);
  res += val;
  return res;
}  // gattIdToString

/**
 * @brief Convert an esp_ble_addr_type_t to a string representation.
 */
const char *BLEUtils::addressTypeToString(esp_ble_addr_type_t type) {
  switch (type) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG
    case BLE_ADDR_TYPE_PUBLIC:     return "BLE_ADDR_TYPE_PUBLIC";
    case BLE_ADDR_TYPE_RANDOM:     return "BLE_ADDR_TYPE_RANDOM";
    case BLE_ADDR_TYPE_RPA_PUBLIC: return "BLE_ADDR_TYPE_RPA_PUBLIC";
    case BLE_ADDR_TYPE_RPA_RANDOM: return "BLE_ADDR_TYPE_RPA_RANDOM";
#endif
    default: return " esp_ble_addr_type_t";
  }
}  // addressTypeToString

/**
 * @brief Convert the BLE Advertising Data flags to a string.
 * @param adFlags The flags to convert
 * @return String A string representation of the advertising flags.
 */
String BLEUtils::adFlagsToString(uint8_t adFlags) {
  String res;
  if (adFlags & (1 << 0)) {
    res += "[LE Limited Discoverable Mode] ";
  }
  if (adFlags & (1 << 1)) {
    res += "[LE General Discoverable Mode] ";
  }
  if (adFlags & (1 << 2)) {
    res += "[BR/EDR Not Supported] ";
  }
  if (adFlags & (1 << 3)) {
    res += "[Simultaneous LE and BR/EDR to Same Device Capable (Controller)] ";
  }
  if (adFlags & (1 << 4)) {
    res += "[Simultaneous LE and BR/EDR to Same Device Capable (Host)] ";
  }
  return res;
}  // adFlagsToString

