espressif/arduino-esp32/libraries/BLE/src/BLEUtils.cpp
esp_gatt_id_t BLEUtils::buildGattId(esp_bt_uuid_t uuid, uint8_t inst_id) {
  esp_gatt_id_t retGattId;
  retGattId.uuid = uuid;
  retGattId.inst_id = inst_id;
  return retGattId;
}

esp_gatt_srvc_id_t BLEUtils::buildGattSrvcId(esp_gatt_id_t gattId, bool is_primary) {
  esp_gatt_srvc_id_t retSrvcId;
  retSrvcId.id = gattId;
  retSrvcId.is_primary = is_primary;
  return retSrvcId;
}

/**
 * @brief Convert a close/disconnect reason to a string.
 * @param [in] reason The close reason.
 * @return A string representation of the reason.
 */
String BLEUtils::gattCloseReasonToString(esp_gatt_conn_reason_t reason) {
  switch (reason) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG
    case ESP_GATT_CONN_UNKNOWN:
    {
      return "ESP_GATT_CONN_UNKNOWN";
    }
    case ESP_GATT_CONN_L2C_FAILURE:
    {
      return "ESP_GATT_CONN_L2C_FAILURE";
    }
    case ESP_GATT_CONN_TIMEOUT:
    {
      return "ESP_GATT_CONN_TIMEOUT";
    }
    case ESP_GATT_CONN_TERMINATE_PEER_USER:
    {
      return "ESP_GATT_CONN_TERMINATE_PEER_USER";
    }
    case ESP_GATT_CONN_TERMINATE_LOCAL_HOST:
    {
      return "ESP_GATT_CONN_TERMINATE_LOCAL_HOST";
    }
    case ESP_GATT_CONN_FAIL_ESTABLISH:
    {
      return "ESP_GATT_CONN_FAIL_ESTABLISH";
    }
    case ESP_GATT_CONN_LMP_TIMEOUT:
    {
      return "ESP_GATT_CONN_LMP_TIMEOUT";
    }
    case ESP_GATT_CONN_CONN_CANCEL:
    {
      return "ESP_GATT_CONN_CONN_CANCEL";
    }
    case ESP_GATT_CONN_NONE:
    {
      return "ESP_GATT_CONN_NONE";
    }
#endif
    default:
    {
      return "Unknown";
    }
  }
}  // gattCloseReasonToString

String BLEUtils::gattClientEventTypeToString(esp_gattc_cb_event_t eventType) {
  switch (eventType) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG
    case ESP_GATTC_ACL_EVT:            return "ESP_GATTC_ACL_EVT";
    case ESP_GATTC_ADV_DATA_EVT:       return "ESP_GATTC_ADV_DATA_EVT";
    case ESP_GATTC_ADV_VSC_EVT:        return "ESP_GATTC_ADV_VSC_EVT";
    case ESP_GATTC_BTH_SCAN_CFG_EVT:   return "ESP_GATTC_BTH_SCAN_CFG_EVT";
    case ESP_GATTC_BTH_SCAN_DIS_EVT:   return "ESP_GATTC_BTH_SCAN_DIS_EVT";
    case ESP_GATTC_BTH_SCAN_ENB_EVT:   return "ESP_GATTC_BTH_SCAN_ENB_EVT";
    case ESP_GATTC_BTH_SCAN_PARAM_EVT: return "ESP_GATTC_BTH_SCAN_PARAM_EVT";
    case ESP_GATTC_BTH_SCAN_RD_EVT:    return "ESP_GATTC_BTH_SCAN_RD_EVT";
    case ESP_GATTC_BTH_SCAN_THR_EVT:   return "ESP_GATTC_BTH_SCAN_THR_EVT";
    case ESP_GATTC_CANCEL_OPEN_EVT:    return "ESP_GATTC_CANCEL_OPEN_EVT";
    case ESP_GATTC_CFG_MTU_EVT:        return "ESP_GATTC_CFG_MTU_EVT";
    case ESP_GATTC_CLOSE_EVT:          return "ESP_GATTC_CLOSE_EVT";
    case ESP_GATTC_CONGEST_EVT:        return "ESP_GATTC_CONGEST_EVT";
    case ESP_GATTC_CONNECT_EVT:        return "ESP_GATTC_CONNECT_EVT";
    case ESP_GATTC_DISCONNECT_EVT:     return "ESP_GATTC_DISCONNECT_EVT";
    case ESP_GATTC_ENC_CMPL_CB_EVT:    return "ESP_GATTC_ENC_CMPL_CB_EVT";
    case ESP_GATTC_EXEC_EVT:
      return "ESP_GATTC_EXEC_EVT";
      //case ESP_GATTC_GET_CHAR_EVT:
      //			return "ESP_GATTC_GET_CHAR_EVT";
      //case ESP_GATTC_GET_DESCR_EVT:
      //			return "ESP_GATTC_GET_DESCR_EVT";
      //case ESP_GATTC_GET_INCL_SRVC_EVT:
      //			return "ESP_GATTC_GET_INCL_SRVC_EVT";
    case ESP_GATTC_MULT_ADV_DATA_EVT:    return "ESP_GATTC_MULT_ADV_DATA_EVT";
    case ESP_GATTC_MULT_ADV_DIS_EVT:     return "ESP_GATTC_MULT_ADV_DIS_EVT";
    case ESP_GATTC_MULT_ADV_ENB_EVT:     return "ESP_GATTC_MULT_ADV_ENB_EVT";
    case ESP_GATTC_MULT_ADV_UPD_EVT:     return "ESP_GATTC_MULT_ADV_UPD_EVT";
    case ESP_GATTC_NOTIFY_EVT:           return "ESP_GATTC_NOTIFY_EVT";
    case ESP_GATTC_OPEN_EVT:             return "ESP_GATTC_OPEN_EVT";
    case ESP_GATTC_PREP_WRITE_EVT:       return "ESP_GATTC_PREP_WRITE_EVT";
    case ESP_GATTC_READ_CHAR_EVT:        return "ESP_GATTC_READ_CHAR_EVT";
    case ESP_GATTC_REG_EVT:              return "ESP_GATTC_REG_EVT";
    case ESP_GATTC_REG_FOR_NOTIFY_EVT:   return "ESP_GATTC_REG_FOR_NOTIFY_EVT";
    case ESP_GATTC_SCAN_FLT_CFG_EVT:     return "ESP_GATTC_SCAN_FLT_CFG_EVT";
    case ESP_GATTC_SCAN_FLT_PARAM_EVT:   return "ESP_GATTC_SCAN_FLT_PARAM_EVT";
    case ESP_GATTC_SCAN_FLT_STATUS_EVT:  return "ESP_GATTC_SCAN_FLT_STATUS_EVT";
    case ESP_GATTC_SEARCH_CMPL_EVT:      return "ESP_GATTC_SEARCH_CMPL_EVT";
    case ESP_GATTC_SEARCH_RES_EVT:       return "ESP_GATTC_SEARCH_RES_EVT";
    case ESP_GATTC_SRVC_CHG_EVT:         return "ESP_GATTC_SRVC_CHG_EVT";
    case ESP_GATTC_READ_DESCR_EVT:       return "ESP_GATTC_READ_DESCR_EVT";
    case ESP_GATTC_UNREG_EVT:            return "ESP_GATTC_UNREG_EVT";
    case ESP_GATTC_UNREG_FOR_NOTIFY_EVT: return "ESP_GATTC_UNREG_FOR_NOTIFY_EVT";
    case ESP_GATTC_WRITE_CHAR_EVT:       return "ESP_GATTC_WRITE_CHAR_EVT";
    case ESP_GATTC_WRITE_DESCR_EVT:      return "ESP_GATTC_WRITE_DESCR_EVT";
#endif
    default: log_v("Unknown GATT Client event type: %d", eventType); return "Unknown";
  }
}  // gattClientEventTypeToString

/**
 * @brief Return a string representation of a GATT server event code.
 * @param [in] eventType A GATT server event code.
 * @return A string representation of the GATT server event code.
 */
String BLEUtils::gattServerEventTypeToString(esp_gatts_cb_event_t eventType) {
  switch (eventType) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG
    case ESP_GATTS_REG_EVT:                 return "ESP_GATTS_REG_EVT";
    case ESP_GATTS_READ_EVT:                return "ESP_GATTS_READ_EVT";
    case ESP_GATTS_WRITE_EVT:               return "ESP_GATTS_WRITE_EVT";
    case ESP_GATTS_EXEC_WRITE_EVT:          return "ESP_GATTS_EXEC_WRITE_EVT";
    case ESP_GATTS_MTU_EVT:                 return "ESP_GATTS_MTU_EVT";
    case ESP_GATTS_CONF_EVT:                return "ESP_GATTS_CONF_EVT";
    case ESP_GATTS_UNREG_EVT:               return "ESP_GATTS_UNREG_EVT";
    case ESP_GATTS_CREATE_EVT:              return "ESP_GATTS_CREATE_EVT";
    case ESP_GATTS_ADD_INCL_SRVC_EVT:       return "ESP_GATTS_ADD_INCL_SRVC_EVT";
    case ESP_GATTS_ADD_CHAR_EVT:            return "ESP_GATTS_ADD_CHAR_EVT";
    case ESP_GATTS_ADD_CHAR_DESCR_EVT:      return "ESP_GATTS_ADD_CHAR_DESCR_EVT";
    case ESP_GATTS_DELETE_EVT:              return "ESP_GATTS_DELETE_EVT";
    case ESP_GATTS_START_EVT:               return "ESP_GATTS_START_EVT";
    case ESP_GATTS_STOP_EVT:                return "ESP_GATTS_STOP_EVT";
    case ESP_GATTS_CONNECT_EVT:             return "ESP_GATTS_CONNECT_EVT";
    case ESP_GATTS_DISCONNECT_EVT:          return "ESP_GATTS_DISCONNECT_EVT";
    case ESP_GATTS_OPEN_EVT:                return "ESP_GATTS_OPEN_EVT";
    case ESP_GATTS_CANCEL_OPEN_EVT:         return "ESP_GATTS_CANCEL_OPEN_EVT";
    case ESP_GATTS_CLOSE_EVT:               return "ESP_GATTS_CLOSE_EVT";
    case ESP_GATTS_LISTEN_EVT:              return "ESP_GATTS_LISTEN_EVT";
    case ESP_GATTS_CONGEST_EVT:             return "ESP_GATTS_CONGEST_EVT";
    case ESP_GATTS_RESPONSE_EVT:            return "ESP_GATTS_RESPONSE_EVT";
    case ESP_GATTS_CREAT_ATTR_TAB_EVT:      return "ESP_GATTS_CREAT_ATTR_TAB_EVT";
    case ESP_GATTS_SET_ATTR_VAL_EVT:        return "ESP_GATTS_SET_ATTR_VAL_EVT";
    case ESP_GATTS_SEND_SERVICE_CHANGE_EVT: return "ESP_GATTS_SEND_SERVICE_CHANGE_EVT";
#endif
    default: return "Unknown";
  }
}  // gattServerEventTypeToString

/**
 * @brief Convert a BLE device type to a string.
 * @param [in] type The device type.
 */
const char *BLEUtils::devTypeToString(esp_bt_dev_type_t type) {
  switch (type) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG
    case ESP_BT_DEVICE_TYPE_BREDR: return "ESP_BT_DEVICE_TYPE_BREDR";
    case ESP_BT_DEVICE_TYPE_BLE:   return "ESP_BT_DEVICE_TYPE_BLE";
    case ESP_BT_DEVICE_TYPE_DUMO:  return "ESP_BT_DEVICE_TYPE_DUMO";
#endif
    default: return "Unknown";
  }
}  // devTypeToString

/**
 * @brief Dump the GAP event to the log.
 */
void BLEUtils::dumpGapEvent(esp_gap_ble_cb_event_t event, esp_ble_gap_cb_param_t *param) {
  log_v("Received a GAP event: %s", gapEventToString(event));
  switch (event) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG
    // ESP_GAP_BLE_ADV_DATA_SET_COMPLETE_EVT
    // adv_data_cmpl
    // - esp_bt_status_t
    case ESP_GAP_BLE_ADV_DATA_SET_COMPLETE_EVT:
    {
      log_v("[status: %d]", param->adv_data_cmpl.status);
      break;
    }  // ESP_GAP_BLE_ADV_DATA_SET_COMPLETE_EVT

    // ESP_GAP_BLE_ADV_DATA_RAW_SET_COMPLETE_EVT
    //
    // adv_data_raw_cmpl
    // - esp_bt_status_t status
    case ESP_GAP_BLE_ADV_DATA_RAW_SET_COMPLETE_EVT:
    {
      log_v("[status: %d]", param->adv_data_raw_cmpl.status);
      break;
    }  // ESP_GAP_BLE_ADV_DATA_RAW_SET_COMPLETE_EVT

