espressif/arduino-esp32/libraries/BLE/src/BLEUtils.cpp
    // ESP_GAP_BLE_ADV_START_COMPLETE_EVT
    //
    // adv_start_cmpl
    // - esp_bt_status_t status
    case ESP_GAP_BLE_ADV_START_COMPLETE_EVT:
    {
      log_v("[status: %d]", param->adv_start_cmpl.status);
      break;
    }  // ESP_GAP_BLE_ADV_START_COMPLETE_EVT

    // ESP_GAP_BLE_ADV_STOP_COMPLETE_EVT
    //
    // adv_stop_cmpl
    // - esp_bt_status_t status
    case ESP_GAP_BLE_ADV_STOP_COMPLETE_EVT:
    {
      log_v("[status: %d]", param->adv_stop_cmpl.status);
      break;
    }  // ESP_GAP_BLE_ADV_STOP_COMPLETE_EVT

    // ESP_GAP_BLE_AUTH_CMPL_EVT
    //
    // auth_cmpl
    // - esp_bd_addr_t bd_addr
    // - bool key_present
    // - esp_link_key key
    // - bool success
    // - uint8_t fail_reason
    // - esp_bd_addr_type_t addr_type
    // - esp_bt_dev_type_t dev_type
    case ESP_GAP_BLE_AUTH_CMPL_EVT:
    {
      log_v(
        "[bd_addr: %s, key_present: %d, key: ***, key_type: %d, success: %d, fail_reason: %d, addr_type: ***, dev_type: %s]",
        BLEAddress(param->ble_security.auth_cmpl.bd_addr).toString().c_str(), param->ble_security.auth_cmpl.key_present, param->ble_security.auth_cmpl.key_type,
        param->ble_security.auth_cmpl.success, param->ble_security.auth_cmpl.fail_reason, BLEUtils::devTypeToString(param->ble_security.auth_cmpl.dev_type)
      );
      break;
    }  // ESP_GAP_BLE_AUTH_CMPL_EVT

    // ESP_GAP_BLE_CLEAR_BOND_DEV_COMPLETE_EVT
    //
    // clear_bond_dev_cmpl
    // - esp_bt_status_t status
    case ESP_GAP_BLE_CLEAR_BOND_DEV_COMPLETE_EVT:
    {
      log_v("[status: %d]", param->clear_bond_dev_cmpl.status);
      break;
    }  // ESP_GAP_BLE_CLEAR_BOND_DEV_COMPLETE_EVT

    // ESP_GAP_BLE_LOCAL_IR_EVT
    case ESP_GAP_BLE_LOCAL_IR_EVT:
    {
      break;
    }  // ESP_GAP_BLE_LOCAL_IR_EVT

    // ESP_GAP_BLE_LOCAL_ER_EVT
    case ESP_GAP_BLE_LOCAL_ER_EVT:
    {
      break;
    }  // ESP_GAP_BLE_LOCAL_ER_EVT

    // ESP_GAP_BLE_NC_REQ_EVT
    case ESP_GAP_BLE_NC_REQ_EVT:
    {
      log_v("[bd_addr: %s, passkey: %d]", BLEAddress(param->ble_security.key_notif.bd_addr).toString().c_str(), param->ble_security.key_notif.passkey);
      break;
    }  // ESP_GAP_BLE_NC_REQ_EVT

    // ESP_GAP_BLE_READ_RSSI_COMPLETE_EVT
    //
    // read_rssi_cmpl
    // - esp_bt_status_t status
    // - int8_t rssi
    // - esp_bd_addr_t remote_addr
    case ESP_GAP_BLE_READ_RSSI_COMPLETE_EVT:
    {
      log_v(
        "[status: %d, rssi: %d, remote_addr: %s]", param->read_rssi_cmpl.status, param->read_rssi_cmpl.rssi,
        BLEAddress(param->read_rssi_cmpl.remote_addr).toString().c_str()
      );
      break;
    }  // ESP_GAP_BLE_READ_RSSI_COMPLETE_EVT

    // ESP_GAP_BLE_SCAN_PARAM_SET_COMPLETE_EVT
    //
    // scan_param_cmpl.
    // - esp_bt_status_t status
    case ESP_GAP_BLE_SCAN_PARAM_SET_COMPLETE_EVT:
    {
      log_v("[status: %d]", param->scan_param_cmpl.status);
      break;
    }  // ESP_GAP_BLE_SCAN_PARAM_SET_COMPLETE_EVT

    // ESP_GAP_BLE_SCAN_RESULT_EVT
    //
    // scan_rst:
    // - search_evt
    // - bda
    // - dev_type
    // - ble_addr_type
    // - ble_evt_type
    // - rssi
    // - ble_adv
    // - flag
    // - num_resps
    // - adv_data_len
    // - scan_rsp_len
    case ESP_GAP_BLE_SCAN_RESULT_EVT:
    {
      switch (param->scan_rst.search_evt) {
        case ESP_GAP_SEARCH_INQ_RES_EVT:
        {
          log_v(
            "search_evt: %s, bda: %s, dev_type: %s, ble_addr_type: %s, ble_evt_type: %s, rssi: %d, ble_adv: ??, flag: %d (%s), num_resps: %d, adv_data_len: "
            "%d, scan_rsp_len: %d",
            searchEventTypeToString(param->scan_rst.search_evt), BLEAddress(param->scan_rst.bda).toString().c_str(), devTypeToString(param->scan_rst.dev_type),
            addressTypeToString(param->scan_rst.ble_addr_type), eventTypeToString(param->scan_rst.ble_evt_type), param->scan_rst.rssi, param->scan_rst.flag,
            adFlagsToString(param->scan_rst.flag).c_str(), param->scan_rst.num_resps, param->scan_rst.adv_data_len, param->scan_rst.scan_rsp_len
          );
          break;
        }  // ESP_GAP_SEARCH_INQ_RES_EVT

        default:
        {
          log_v("search_evt: %s", searchEventTypeToString(param->scan_rst.search_evt));
          break;
        }
      }
      break;
    }  // ESP_GAP_BLE_SCAN_RESULT_EVT

    // ESP_GAP_BLE_SCAN_RSP_DATA_SET_COMPLETE_EVT
    //
    // scan_rsp_data_cmpl
    // - esp_bt_status_t status
    case ESP_GAP_BLE_SCAN_RSP_DATA_SET_COMPLETE_EVT:
    {
      log_v("[status: %d]", param->scan_rsp_data_cmpl.status);
      break;
    }  // ESP_GAP_BLE_SCAN_RSP_DATA_SET_COMPLETE_EVT

    // ESP_GAP_BLE_SCAN_RSP_DATA_RAW_SET_COMPLETE_EVT
    case ESP_GAP_BLE_SCAN_RSP_DATA_RAW_SET_COMPLETE_EVT:
    {
      log_v("[status: %d]", param->scan_rsp_data_raw_cmpl.status);
      break;
    }  // ESP_GAP_BLE_SCAN_RSP_DATA_RAW_SET_COMPLETE_EVT

    // ESP_GAP_BLE_SCAN_START_COMPLETE_EVT
    //
    // scan_start_cmpl
    // - esp_bt_status_t status
    case ESP_GAP_BLE_SCAN_START_COMPLETE_EVT:
    {
      log_v("[status: %d]", param->scan_start_cmpl.status);
      break;
    }  // ESP_GAP_BLE_SCAN_START_COMPLETE_EVT

    // ESP_GAP_BLE_SCAN_STOP_COMPLETE_EVT
    //
    // scan_stop_cmpl
    // - esp_bt_status_t status
    case ESP_GAP_BLE_SCAN_STOP_COMPLETE_EVT:
    {
      log_v("[status: %d]", param->scan_stop_cmpl.status);
      break;
    }  // ESP_GAP_BLE_SCAN_STOP_COMPLETE_EVT

    // ESP_GAP_BLE_UPDATE_CONN_PARAMS_EVT
    //
    // update_conn_params
    // - esp_bt_status_t status
    // - esp_bd_addr_t bda
    // - uint16_t min_int
    // - uint16_t max_int
    // - uint16_t latency
    // - uint16_t conn_int
    // - uint16_t timeout
    case ESP_GAP_BLE_UPDATE_CONN_PARAMS_EVT:
    {
      log_v(
        "[status: %d, bd_addr: %s, min_int: %d, max_int: %d, latency: %d, conn_int: %d, timeout: %d]", param->update_conn_params.status,
        BLEAddress(param->update_conn_params.bda).toString().c_str(), param->update_conn_params.min_int, param->update_conn_params.max_int,
        param->update_conn_params.latency, param->update_conn_params.conn_int, param->update_conn_params.timeout
      );
      break;
    }  // ESP_GAP_BLE_SCAN_UPDATE_CONN_PARAMS_EVT

    // ESP_GAP_BLE_SEC_REQ_EVT
    case ESP_GAP_BLE_SEC_REQ_EVT:
    {
      log_v("[bd_addr: %s]", BLEAddress(param->ble_security.ble_req.bd_addr).toString().c_str());
      break;
    }  // ESP_GAP_BLE_SEC_REQ_EVT
#endif
    default:
    {
      log_v("*** dumpGapEvent: Logger not coded ***");
      break;
    }  // default
  }  // switch
}  // dumpGapEvent

/**
 * @brief Decode and dump a GATT client event
 *
 * @param [in] event The type of event received.
 * @param [in] evtParam The data associated with the event.
 */
void BLEUtils::dumpGattClientEvent(esp_gattc_cb_event_t event, esp_gatt_if_t gattc_if, esp_ble_gattc_cb_param_t *evtParam) {

