espressif/arduino-esp32/libraries/BLE/src/BLEUtils.cpp
  //esp_ble_gattc_cb_param_t* evtParam = (esp_ble_gattc_cb_param_t*) param;
  log_v("GATT Event: %s", BLEUtils::gattClientEventTypeToString(event).c_str());
  switch (event) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG
    // ESP_GATTC_CLOSE_EVT
    //
    // close:
    // - esp_gatt_status_t      status
    // - uint16_t               conn_id
    // - esp_bd_addr_t          remote_bda
    // - esp_gatt_conn_reason_t reason
    case ESP_GATTC_CLOSE_EVT:
    {
      log_v(
        "[status: %s, reason:%s, conn_id: %d]", BLEUtils::gattStatusToString(evtParam->close.status).c_str(),
        BLEUtils::gattCloseReasonToString(evtParam->close.reason).c_str(), evtParam->close.conn_id
      );
      break;
    }

    // ESP_GATTC_CONNECT_EVT
    //
    // connect:
    // - esp_gatt_status_t status
    // - uint16_t          conn_id
    // - esp_bd_addr_t     remote_bda
    case ESP_GATTC_CONNECT_EVT:
    {
      log_v("[conn_id: %d, remote_bda: %s]", evtParam->connect.conn_id, BLEAddress(evtParam->connect.remote_bda).toString().c_str());
      break;
    }

    // ESP_GATTC_DISCONNECT_EVT
    //
    // disconnect:
    // - esp_gatt_conn_reason_t reason
    // - uint16_t               conn_id
    // - esp_bd_addr_t          remote_bda
    case ESP_GATTC_DISCONNECT_EVT:
    {
      log_v(
        "[reason: %s, conn_id: %d, remote_bda: %s]", BLEUtils::gattCloseReasonToString(evtParam->disconnect.reason).c_str(), evtParam->disconnect.conn_id,
        BLEAddress(evtParam->disconnect.remote_bda).toString().c_str()
      );
      break;
    }  // ESP_GATTC_DISCONNECT_EVT

    // ESP_GATTC_GET_CHAR_EVT
    //
    // get_char:
    // - esp_gatt_status_t    status
    // - uin1t6_t             conn_id
    // - esp_gatt_srvc_id_t   srvc_id
    // - esp_gatt_id_t        char_id
    // - esp_gatt_char_prop_t char_prop
    /*
		case ESP_GATTC_GET_CHAR_EVT: {

			// If the status of the event shows that we have a value other than ESP_GATT_OK then the
			// characteristic fields are not set to a usable value .. so don't try and log them.
			if (evtParam->get_char.status == ESP_GATT_OK) {
				String description = "Unknown";
				if (evtParam->get_char.char_id.uuid.len == ESP_UUID_LEN_16) {
					description = BLEUtils::gattCharacteristicUUIDToString(evtParam->get_char.char_id.uuid.uuid.uuid16);
				}
				log_v("[status: %s, conn_id: %d, srvc_id: %s, char_id: %s [description: %s]\nchar_prop: %s]",
					BLEUtils::gattStatusToString(evtParam->get_char.status).c_str(),
					evtParam->get_char.conn_id,
					BLEUtils::gattServiceIdToString(evtParam->get_char.srvc_id).c_str(),
					gattIdToString(evtParam->get_char.char_id).c_str(),
					description.c_str(),
					BLEUtils::characteristicPropertiesToString(evtParam->get_char.char_prop).c_str()
				);
			} else {
				log_v("[status: %s, conn_id: %d, srvc_id: %s]",
					BLEUtils::gattStatusToString(evtParam->get_char.status).c_str(),
					evtParam->get_char.conn_id,
					BLEUtils::gattServiceIdToString(evtParam->get_char.srvc_id).c_str()
				);
			}
			break;
		} // ESP_GATTC_GET_CHAR_EVT
		*/

    // ESP_GATTC_NOTIFY_EVT
    //
    // notify
    // uint16_t           conn_id
    // esp_bd_addr_t      remote_bda
    // handle             handle
    // uint16_t           value_len
    // uint8_t*           value
    // bool               is_notify
    //
    case ESP_GATTC_NOTIFY_EVT:
    {
      log_v(
        "[conn_id: %d, remote_bda: %s, handle: %d 0x%.2x, value_len: %d, is_notify: %d]", evtParam->notify.conn_id,
        BLEAddress(evtParam->notify.remote_bda).toString().c_str(), evtParam->notify.handle, evtParam->notify.handle, evtParam->notify.value_len,
        evtParam->notify.is_notify
      );
      break;
    }

    // ESP_GATTC_OPEN_EVT
    //
    // open:
    // - esp_gatt_status_t status
    // - uint16_t          conn_id
    // - esp_bd_addr_t     remote_bda
    // - uint16_t          mtu
    //
    case ESP_GATTC_OPEN_EVT:
    {
      log_v(
        "[status: %s, conn_id: %d, remote_bda: %s, mtu: %d]", BLEUtils::gattStatusToString(evtParam->open.status).c_str(), evtParam->open.conn_id,
        BLEAddress(evtParam->open.remote_bda).toString().c_str(), evtParam->open.mtu
      );
      break;
    }  // ESP_GATTC_OPEN_EVT

    // ESP_GATTC_READ_CHAR_EVT
    //
    // Callback to indicate that requested data that we wanted to read is now available.
    //
    // read:
    // esp_gatt_status_t  status
    // uint16_t           conn_id
    // uint16_t           handle
    // uint8_t*           value
    // uint16_t           value_type
    // uint16_t           value_len
    case ESP_GATTC_READ_CHAR_EVT:
    {
      log_v(
        "[status: %s, conn_id: %d, handle: %d 0x%.2x, value_len: %d]", BLEUtils::gattStatusToString(evtParam->read.status).c_str(), evtParam->read.conn_id,
        evtParam->read.handle, evtParam->read.handle, evtParam->read.value_len
      );
      if (evtParam->read.status == ESP_GATT_OK) {
        GeneralUtils::hexDump(evtParam->read.value, evtParam->read.value_len);
        /*
				char* pHexData = BLEUtils::buildHexData(nullptr, evtParam->read.value, evtParam->read.value_len);
				log_v("value: %s \"%s\"", pHexData, BLEUtils::buildPrintData(evtParam->read.value, evtParam->read.value_len).c_str());
				free(pHexData);
				*/
      }
      break;
    }  // ESP_GATTC_READ_CHAR_EVT

    // ESP_GATTC_REG_EVT
    //
    // reg:
    // - esp_gatt_status_t status
    // - uint16_t          app_id
    case ESP_GATTC_REG_EVT:
    {
      log_v("[status: %s, app_id: 0x%x]", BLEUtils::gattStatusToString(evtParam->reg.status).c_str(), evtParam->reg.app_id);
      break;
    }  // ESP_GATTC_REG_EVT

    // ESP_GATTC_REG_FOR_NOTIFY_EVT
    //
    // reg_for_notify:
    // - esp_gatt_status_t status
    // - uint16_t          handle
    case ESP_GATTC_REG_FOR_NOTIFY_EVT:
    {
      log_v(
        "[status: %s, handle: %d 0x%.2x]", BLEUtils::gattStatusToString(evtParam->reg_for_notify.status).c_str(), evtParam->reg_for_notify.handle,
        evtParam->reg_for_notify.handle
      );
      break;
    }  // ESP_GATTC_REG_FOR_NOTIFY_EVT

    // ESP_GATTC_SEARCH_CMPL_EVT
    //
    // search_cmpl:
    // - esp_gatt_status_t status
    // - uint16_t          conn_id
    case ESP_GATTC_SEARCH_CMPL_EVT:
    {
      log_v("[status: %s, conn_id: %d]", BLEUtils::gattStatusToString(evtParam->search_cmpl.status).c_str(), evtParam->search_cmpl.conn_id);
      break;
    }  // ESP_GATTC_SEARCH_CMPL_EVT

    // ESP_GATTC_SEARCH_RES_EVT
    //
    // search_res:
    // - uint16_t      conn_id
    // - uint16_t      start_handle
    // - uint16_t      end_handle
    // - esp_gatt_id_t srvc_id
    case ESP_GATTC_SEARCH_RES_EVT:
    {
      log_v(
        "[conn_id: %d, start_handle: %d 0x%.2x, end_handle: %d 0x%.2x, srvc_id: %s", evtParam->search_res.conn_id, evtParam->search_res.start_handle,
        evtParam->search_res.start_handle, evtParam->search_res.end_handle, evtParam->search_res.end_handle,
        gattIdToString(evtParam->search_res.srvc_id).c_str()
      );
      break;
    }  // ESP_GATTC_SEARCH_RES_EVT

