espressif/arduino-esp32/libraries/BLE/src/BLEUtils.cpp
    // ESP_GATTC_WRITE_CHAR_EVT
    //
    // write:
    // - esp_gatt_status_t status
    // - uint16_t          conn_id
    // - uint16_t          handle
    // - uint16_t          offset
    case ESP_GATTC_WRITE_CHAR_EVT:
    {
      log_v(
        "[status: %s, conn_id: %d, handle: %d 0x%.2x, offset: %d]", BLEUtils::gattStatusToString(evtParam->write.status).c_str(), evtParam->write.conn_id,
        evtParam->write.handle, evtParam->write.handle, evtParam->write.offset
      );
      break;
    }  // ESP_GATTC_WRITE_CHAR_EVT
#endif
    default: break;
  }
}  // dumpGattClientEvent

/**
 * @brief Dump the details of a GATT server event.
 * A GATT Server event is a callback received from the BLE subsystem when we are acting as a BLE
 * server.  The callback indicates the type of event in the `event` field.  The `evtParam` is a
 * union of structures where we can use the `event` to indicate which of the structures has been
 * populated and hence is valid.
 *
 * @param [in] event The event type that was posted.
 * @param [in] evtParam A union of structures only one of which is populated.
 */
void BLEUtils::dumpGattServerEvent(esp_gatts_cb_event_t event, esp_gatt_if_t gatts_if, esp_ble_gatts_cb_param_t *evtParam) {
  log_v("GATT ServerEvent: %s", BLEUtils::gattServerEventTypeToString(event).c_str());
  switch (event) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG

    case ESP_GATTS_ADD_CHAR_DESCR_EVT:
    {
      log_v(
        "[status: %s, attr_handle: %d 0x%.2x, service_handle: %d 0x%.2x, char_uuid: %s]", gattStatusToString(evtParam->add_char_descr.status).c_str(),
        evtParam->add_char_descr.attr_handle, evtParam->add_char_descr.attr_handle, evtParam->add_char_descr.service_handle,
        evtParam->add_char_descr.service_handle, BLEUUID(evtParam->add_char_descr.descr_uuid).toString().c_str()
      );
      break;
    }  // ESP_GATTS_ADD_CHAR_DESCR_EVT

    case ESP_GATTS_ADD_CHAR_EVT:
    {
      if (evtParam->add_char.status == ESP_GATT_OK) {
        log_v(
          "[status: %s, attr_handle: %d 0x%.2x, service_handle: %d 0x%.2x, char_uuid: %s]", gattStatusToString(evtParam->add_char.status).c_str(),
          evtParam->add_char.attr_handle, evtParam->add_char.attr_handle, evtParam->add_char.service_handle, evtParam->add_char.service_handle,
          BLEUUID(evtParam->add_char.char_uuid).toString().c_str()
        );
      } else {
        log_e(
          "[status: %s, attr_handle: %d 0x%.2x, service_handle: %d 0x%.2x, char_uuid: %s]", gattStatusToString(evtParam->add_char.status).c_str(),
          evtParam->add_char.attr_handle, evtParam->add_char.attr_handle, evtParam->add_char.service_handle, evtParam->add_char.service_handle,
          BLEUUID(evtParam->add_char.char_uuid).toString().c_str()
        );
      }
      break;
    }  // ESP_GATTS_ADD_CHAR_EVT

    // ESP_GATTS_CONF_EVT
    //
    // conf:
    // - esp_gatt_status_t status  – The status code.
    // - uint16_t          conn_id – The connection used.
    case ESP_GATTS_CONF_EVT:
    {
      log_v("[status: %s, conn_id: 0x%.2x]", gattStatusToString(evtParam->conf.status).c_str(), evtParam->conf.conn_id);
      break;
    }  // ESP_GATTS_CONF_EVT

    case ESP_GATTS_CONGEST_EVT:
    {
      log_v("[conn_id: %d, congested: %d]", evtParam->congest.conn_id, evtParam->congest.congested);
      break;
    }  // ESP_GATTS_CONGEST_EVT

    case ESP_GATTS_CONNECT_EVT:
    {
      log_v("[conn_id: %d, remote_bda: %s]", evtParam->connect.conn_id, BLEAddress(evtParam->connect.remote_bda).toString().c_str());
      break;
    }  // ESP_GATTS_CONNECT_EVT

    case ESP_GATTS_CREATE_EVT:
    {
      log_v(
        "[status: %s, service_handle: %d 0x%.2x, service_id: [%s]]", gattStatusToString(evtParam->create.status).c_str(), evtParam->create.service_handle,
        evtParam->create.service_handle, gattServiceIdToString(evtParam->create.service_id).c_str()
      );
      break;
    }  // ESP_GATTS_CREATE_EVT

    case ESP_GATTS_DISCONNECT_EVT:
    {
      log_v("[conn_id: %d, remote_bda: %s]", evtParam->connect.conn_id, BLEAddress(evtParam->connect.remote_bda).toString().c_str());
      break;
    }  // ESP_GATTS_DISCONNECT_EVT

    // ESP_GATTS_EXEC_WRITE_EVT
    // exec_write:
    // - uint16_t conn_id
    // - uint32_t trans_id
    // - esp_bd_addr_t bda
    // - uint8_t exec_write_flag
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_VERBOSE
    case ESP_GATTS_EXEC_WRITE_EVT:
    {
      char *pWriteFlagText;
      switch (evtParam->exec_write.exec_write_flag) {
        case ESP_GATT_PREP_WRITE_EXEC:
        {
          pWriteFlagText = (char *)"WRITE";
          break;
        }

        case ESP_GATT_PREP_WRITE_CANCEL:
        {
          pWriteFlagText = (char *)"CANCEL";
          break;
        }

        default: pWriteFlagText = (char *)"<Unknown>"; break;
      }

      log_v(
        "[conn_id: %d, trans_id: %d, bda: %s, exec_write_flag: 0x%.2x=%s]", evtParam->exec_write.conn_id, evtParam->exec_write.trans_id,
        BLEAddress(evtParam->exec_write.bda).toString().c_str(), evtParam->exec_write.exec_write_flag, pWriteFlagText
      );
      break;
    }  // ESP_GATTS_DISCONNECT_EVT
#endif

    case ESP_GATTS_MTU_EVT:
    {
      log_v("[conn_id: %d, mtu: %d]", evtParam->mtu.conn_id, evtParam->mtu.mtu);
      break;
    }  // ESP_GATTS_MTU_EVT

    case ESP_GATTS_READ_EVT:
    {
      log_v(
        "[conn_id: %d, trans_id: %d, bda: %s, handle: 0x%.2x, is_long: %d, need_rsp:%d]", evtParam->read.conn_id, evtParam->read.trans_id,
        BLEAddress(evtParam->read.bda).toString().c_str(), evtParam->read.handle, evtParam->read.is_long, evtParam->read.need_rsp
      );
      break;
    }  // ESP_GATTS_READ_EVT

    case ESP_GATTS_RESPONSE_EVT:
    {
      log_v("[status: %s, handle: 0x%.2x]", gattStatusToString(evtParam->rsp.status).c_str(), evtParam->rsp.handle);
      break;
    }  // ESP_GATTS_RESPONSE_EVT

    case ESP_GATTS_REG_EVT:
    {
      log_v("[status: %s, app_id: %d]", gattStatusToString(evtParam->reg.status).c_str(), evtParam->reg.app_id);
      break;
    }  // ESP_GATTS_REG_EVT

