espressif/arduino-esp32/libraries/BLE/src/BLEUtils.cpp
    // ESP_GATTS_START_EVT
    //
    // start:
    // - esp_gatt_status_t status
    // - uint16_t          service_handle
    case ESP_GATTS_START_EVT:
    {
      log_v("[status: %s, service_handle: 0x%.2x]", gattStatusToString(evtParam->start.status).c_str(), evtParam->start.service_handle);
      break;
    }  // ESP_GATTS_START_EVT

    // ESP_GATTS_WRITE_EVT
    //
    // write:
    // - uint16_t      conn_id  – The connection id.
    // - uint16_t      trans_id – The transfer id.
    // - esp_bd_addr_t bda      – The address of the partner.
    // - uint16_t      handle   – The attribute handle.
    // - uint16_t      offset   – The offset of the currently received within the whole value.
    // - bool          need_rsp – Do we need a response?
    // - bool          is_prep  – Is this a write prepare?  If set, then this is to be considered part of the received value and not the whole value.  A subsequent ESP_GATTS_EXEC_WRITE will mark the total.
    // - uint16_t      len      – The length of the incoming value part.
    // - uint8_t*      value    – The data for this value part.
    case ESP_GATTS_WRITE_EVT:
    {
      log_v(
        "[conn_id: %d, trans_id: %d, bda: %s, handle: 0x%.2x, offset: %d, need_rsp: %d, is_prep: %d, len: %d]", evtParam->write.conn_id,
        evtParam->write.trans_id, BLEAddress(evtParam->write.bda).toString().c_str(), evtParam->write.handle, evtParam->write.offset, evtParam->write.need_rsp,
        evtParam->write.is_prep, evtParam->write.len
      );
      char *pHex = buildHexData(nullptr, evtParam->write.value, evtParam->write.len);
      log_v("[Data: %s]", pHex);
      free(pHex);
      break;
    }  // ESP_GATTS_WRITE_EVT
#endif
    default: log_v("dumpGattServerEvent: *** NOT CODED ***"); break;
  }
}  // dumpGattServerEvent

/**
 * @brief Convert a BLE event type to a string.
 * @param [in] eventType The event type.
 * @return The event type as a string.
 */
const char *BLEUtils::eventTypeToString(esp_ble_evt_type_t eventType) {
  switch (eventType) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG
    case ESP_BLE_EVT_CONN_ADV:     return "ESP_BLE_EVT_CONN_ADV";
    case ESP_BLE_EVT_CONN_DIR_ADV: return "ESP_BLE_EVT_CONN_DIR_ADV";
    case ESP_BLE_EVT_DISC_ADV:     return "ESP_BLE_EVT_DISC_ADV";
    case ESP_BLE_EVT_NON_CONN_ADV: return "ESP_BLE_EVT_NON_CONN_ADV";
    case ESP_BLE_EVT_SCAN_RSP:     return "ESP_BLE_EVT_SCAN_RSP";
#endif
    default: log_v("Unknown esp_ble_evt_type_t: %d (0x%.2x)", eventType, eventType); return "*** Unknown ***";
  }
}  // eventTypeToString

/**
 * @brief Convert a BT GAP event type to a string representation.
 * @param [in] eventType The type of event.
 * @return A string representation of the event type.
 */
const char *BLEUtils::gapEventToString(uint32_t eventType) {
  switch (eventType) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG
    case ESP_GAP_BLE_ADV_DATA_SET_COMPLETE_EVT:          return "ESP_GAP_BLE_ADV_DATA_SET_COMPLETE_EVT";
    case ESP_GAP_BLE_ADV_DATA_RAW_SET_COMPLETE_EVT:      return "ESP_GAP_BLE_ADV_DATA_RAW_SET_COMPLETE_EVT";
    case ESP_GAP_BLE_ADV_START_COMPLETE_EVT:             return "ESP_GAP_BLE_ADV_START_COMPLETE_EVT";
    case ESP_GAP_BLE_ADV_STOP_COMPLETE_EVT:              /* !< When stop adv complete, the event comes */ return "ESP_GAP_BLE_ADV_STOP_COMPLETE_EVT";
    case ESP_GAP_BLE_AUTH_CMPL_EVT:                      /* Authentication complete indication. */ return "ESP_GAP_BLE_AUTH_CMPL_EVT";
    case ESP_GAP_BLE_CLEAR_BOND_DEV_COMPLETE_EVT:        return "ESP_GAP_BLE_CLEAR_BOND_DEV_COMPLETE_EVT";
    case ESP_GAP_BLE_GET_BOND_DEV_COMPLETE_EVT:          return "ESP_GAP_BLE_GET_BOND_DEV_COMPLETE_EVT";
    case ESP_GAP_BLE_KEY_EVT:                            /* BLE  key event for peer device keys */ return "ESP_GAP_BLE_KEY_EVT";
    case ESP_GAP_BLE_LOCAL_IR_EVT:                       /* BLE local IR event */ return "ESP_GAP_BLE_LOCAL_IR_EVT";
    case ESP_GAP_BLE_LOCAL_ER_EVT:                       /* BLE local ER event */ return "ESP_GAP_BLE_LOCAL_ER_EVT";
    case ESP_GAP_BLE_NC_REQ_EVT:                         /* Numeric Comparison request event */ return "ESP_GAP_BLE_NC_REQ_EVT";
    case ESP_GAP_BLE_OOB_REQ_EVT:                        /* OOB request event */ return "ESP_GAP_BLE_OOB_REQ_EVT";
    case ESP_GAP_BLE_PASSKEY_NOTIF_EVT:                  /* passkey notification event */ return "ESP_GAP_BLE_PASSKEY_NOTIF_EVT";
    case ESP_GAP_BLE_PASSKEY_REQ_EVT:                    /* passkey request event */ return "ESP_GAP_BLE_PASSKEY_REQ_EVT";
    case ESP_GAP_BLE_READ_RSSI_COMPLETE_EVT:             return "ESP_GAP_BLE_READ_RSSI_COMPLETE_EVT";
    case ESP_GAP_BLE_REMOVE_BOND_DEV_COMPLETE_EVT:       return "ESP_GAP_BLE_REMOVE_BOND_DEV_COMPLETE_EVT";
    case ESP_GAP_BLE_SCAN_PARAM_SET_COMPLETE_EVT:        return "ESP_GAP_BLE_SCAN_PARAM_SET_COMPLETE_EVT";
    case ESP_GAP_BLE_SCAN_RESULT_EVT:                    return "ESP_GAP_BLE_SCAN_RESULT_EVT";
    case ESP_GAP_BLE_SCAN_RSP_DATA_RAW_SET_COMPLETE_EVT: return "ESP_GAP_BLE_SCAN_RSP_DATA_RAW_SET_COMPLETE_EVT";
    case ESP_GAP_BLE_SCAN_RSP_DATA_SET_COMPLETE_EVT:     return "ESP_GAP_BLE_SCAN_RSP_DATA_SET_COMPLETE_EVT";
    case ESP_GAP_BLE_SCAN_START_COMPLETE_EVT:            return "ESP_GAP_BLE_SCAN_START_COMPLETE_EVT";
    case ESP_GAP_BLE_SCAN_STOP_COMPLETE_EVT:             return "ESP_GAP_BLE_SCAN_STOP_COMPLETE_EVT";
    case ESP_GAP_BLE_SEC_REQ_EVT:                        /* BLE  security request */ return "ESP_GAP_BLE_SEC_REQ_EVT";
    case ESP_GAP_BLE_SET_LOCAL_PRIVACY_COMPLETE_EVT:     return "ESP_GAP_BLE_SET_LOCAL_PRIVACY_COMPLETE_EVT";
    case ESP_GAP_BLE_SET_PKT_LENGTH_COMPLETE_EVT:        return "ESP_GAP_BLE_SET_PKT_LENGTH_COMPLETE_EVT";
    case ESP_GAP_BLE_SET_STATIC_RAND_ADDR_EVT:           return "ESP_GAP_BLE_SET_STATIC_RAND_ADDR_EVT";
    case ESP_GAP_BLE_UPDATE_CONN_PARAMS_EVT:             return "ESP_GAP_BLE_UPDATE_CONN_PARAMS_EVT";
#endif
    default: log_v("gapEventToString: Unknown event type %d 0x%.2x", eventType, eventType); return "Unknown event type";
  }
}  // gapEventToString

String BLEUtils::gattCharacteristicUUIDToString(uint32_t characteristicUUID) {
  const characteristicMap_t *p = g_characteristicsMappings;
  while (strlen(p->name) > 0) {
    if (p->assignedNumber == characteristicUUID) {
      return String(p->name);
    }
    p++;
  }
  return "Unknown";
}  // gattCharacteristicUUIDToString

/**
 * @brief Given the UUID for a BLE defined descriptor, return its string representation.
 * @param [in] descriptorUUID UUID of the descriptor to be returned as a string.
 * @return The string representation of a descriptor UUID.
 */
String BLEUtils::gattDescriptorUUIDToString(uint32_t descriptorUUID) {
  gattdescriptor_t *p = (gattdescriptor_t *)g_descriptor_ids;
  while (strlen(p->name) > 0) {
    if (p->assignedNumber == descriptorUUID) {
      return String(p->name);
    }
    p++;
  }
  return "";
}  // gattDescriptorUUIDToString

/**
 * @brief Return a string representation of an esp_gattc_service_elem_t.
 * @return A string representation of an esp_gattc_service_elem_t.
 */
String BLEUtils::gattcServiceElementToString(esp_gattc_service_elem_t *pGATTCServiceElement) {
  String res;
  char val[6];
  res += "[uuid: " + BLEUUID(pGATTCServiceElement->uuid).toString() + ", start_handle: ";
  snprintf(val, sizeof(val), "%d", pGATTCServiceElement->start_handle);
  res += val;
  res += " 0x";
  snprintf(val, sizeof(val), "%04x", pGATTCServiceElement->start_handle);
  res += val;
  res += ", end_handle: ";
  snprintf(val, sizeof(val), "%d", pGATTCServiceElement->end_handle);
  res += val;
  res += " 0x";
  snprintf(val, sizeof(val), "%04x", pGATTCServiceElement->end_handle);
  res += val;
  res += "]";
  return res;
}  // gattcServiceElementToString

/**
 * @brief Convert an esp_gatt_srvc_id_t to a string.
 */
String BLEUtils::gattServiceIdToString(esp_gatt_srvc_id_t srvcId) {
  return gattIdToString(srvcId.id);
}  // gattServiceIdToString

