espressif/arduino-esp32/libraries/BLE/src/BLEUtils.cpp
String BLEUtils::gattServiceToString(uint32_t serviceId) {
  gattService_t *p = (gattService_t *)g_gattServices;
  while (strlen(p->name) > 0) {
    if (p->assignedNumber == serviceId) {
      return String(p->name);
    }
    p++;
  }
  return "Unknown";
}  // gattServiceToString

/**
 * @brief Convert a GATT status to a string.
 *
 * @param [in] status The status to convert.
 * @return A string representation of the status.
 */
String BLEUtils::gattStatusToString(esp_gatt_status_t status) {
  switch (status) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG
    case ESP_GATT_OK:                   return "ESP_GATT_OK";
    case ESP_GATT_INVALID_HANDLE:       return "ESP_GATT_INVALID_HANDLE";
    case ESP_GATT_READ_NOT_PERMIT:      return "ESP_GATT_READ_NOT_PERMIT";
    case ESP_GATT_WRITE_NOT_PERMIT:     return "ESP_GATT_WRITE_NOT_PERMIT";
    case ESP_GATT_INVALID_PDU:          return "ESP_GATT_INVALID_PDU";
    case ESP_GATT_INSUF_AUTHENTICATION: return "ESP_GATT_INSUF_AUTHENTICATION";
    case ESP_GATT_REQ_NOT_SUPPORTED:    return "ESP_GATT_REQ_NOT_SUPPORTED";
    case ESP_GATT_INVALID_OFFSET:       return "ESP_GATT_INVALID_OFFSET";
    case ESP_GATT_INSUF_AUTHORIZATION:  return "ESP_GATT_INSUF_AUTHORIZATION";
    case ESP_GATT_PREPARE_Q_FULL:       return "ESP_GATT_PREPARE_Q_FULL";
    case ESP_GATT_NOT_FOUND:            return "ESP_GATT_NOT_FOUND";
    case ESP_GATT_NOT_LONG:             return "ESP_GATT_NOT_LONG";
    case ESP_GATT_INSUF_KEY_SIZE:       return "ESP_GATT_INSUF_KEY_SIZE";
    case ESP_GATT_INVALID_ATTR_LEN:     return "ESP_GATT_INVALID_ATTR_LEN";
    case ESP_GATT_ERR_UNLIKELY:         return "ESP_GATT_ERR_UNLIKELY";
    case ESP_GATT_INSUF_ENCRYPTION:     return "ESP_GATT_INSUF_ENCRYPTION";
    case ESP_GATT_UNSUPPORT_GRP_TYPE:   return "ESP_GATT_UNSUPPORT_GRP_TYPE";
    case ESP_GATT_INSUF_RESOURCE:       return "ESP_GATT_INSUF_RESOURCE";
    case ESP_GATT_NO_RESOURCES:         return "ESP_GATT_NO_RESOURCES";
    case ESP_GATT_INTERNAL_ERROR:       return "ESP_GATT_INTERNAL_ERROR";
    case ESP_GATT_WRONG_STATE:          return "ESP_GATT_WRONG_STATE";
    case ESP_GATT_DB_FULL:              return "ESP_GATT_DB_FULL";
    case ESP_GATT_BUSY:                 return "ESP_GATT_BUSY";
    case ESP_GATT_ERROR:                return "ESP_GATT_ERROR";
    case ESP_GATT_CMD_STARTED:          return "ESP_GATT_CMD_STARTED";
    case ESP_GATT_ILLEGAL_PARAMETER:    return "ESP_GATT_ILLEGAL_PARAMETER";
    case ESP_GATT_PENDING:              return "ESP_GATT_PENDING";
    case ESP_GATT_AUTH_FAIL:            return "ESP_GATT_AUTH_FAIL";
    case ESP_GATT_MORE:                 return "ESP_GATT_MORE";
    case ESP_GATT_INVALID_CFG:          return "ESP_GATT_INVALID_CFG";
    case ESP_GATT_SERVICE_STARTED:      return "ESP_GATT_SERVICE_STARTED";
    case ESP_GATT_ENCRYPTED_NO_MITM:    return "ESP_GATT_ENCRYPTED_NO_MITM";
    case ESP_GATT_NOT_ENCRYPTED:        return "ESP_GATT_NOT_ENCRYPTED";
    case ESP_GATT_CONGESTED:            return "ESP_GATT_CONGESTED";
    case ESP_GATT_DUP_REG:              return "ESP_GATT_DUP_REG";
    case ESP_GATT_ALREADY_OPEN:         return "ESP_GATT_ALREADY_OPEN";
    case ESP_GATT_CANCEL:               return "ESP_GATT_CANCEL";
    case ESP_GATT_STACK_RSP:            return "ESP_GATT_STACK_RSP";
    case ESP_GATT_APP_RSP:              return "ESP_GATT_APP_RSP";
    case ESP_GATT_UNKNOWN_ERROR:        return "ESP_GATT_UNKNOWN_ERROR";
    case ESP_GATT_CCC_CFG_ERR:          return "ESP_GATT_CCC_CFG_ERR";
    case ESP_GATT_PRC_IN_PROGRESS:      return "ESP_GATT_PRC_IN_PROGRESS";
    case ESP_GATT_OUT_OF_RANGE:         return "ESP_GATT_OUT_OF_RANGE";
#endif
    default: return "Unknown";
  }
}  // gattStatusToString

String BLEUtils::getMember(uint32_t memberId) {
  member_t *p = (member_t *)members_ids;

  while (strlen(p->name) > 0) {
    if (p->assignedNumber == memberId) {
      return String(p->name);
    }
    p++;
  }
  return "Unknown";
}

/**
 * @brief convert a GAP search event to a string.
 * @param [in] searchEvt
 * @return The search event type as a string.
 */
const char *BLEUtils::searchEventTypeToString(esp_gap_search_evt_t searchEvt) {
  switch (searchEvt) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG
    case ESP_GAP_SEARCH_INQ_RES_EVT:            return "ESP_GAP_SEARCH_INQ_RES_EVT";
    case ESP_GAP_SEARCH_INQ_CMPL_EVT:           return "ESP_GAP_SEARCH_INQ_CMPL_EVT";
    case ESP_GAP_SEARCH_DISC_RES_EVT:           return "ESP_GAP_SEARCH_DISC_RES_EVT";
    case ESP_GAP_SEARCH_DISC_BLE_RES_EVT:       return "ESP_GAP_SEARCH_DISC_BLE_RES_EVT";
    case ESP_GAP_SEARCH_DISC_CMPL_EVT:          return "ESP_GAP_SEARCH_DISC_CMPL_EVT";
    case ESP_GAP_SEARCH_DI_DISC_CMPL_EVT:       return "ESP_GAP_SEARCH_DI_DISC_CMPL_EVT";
    case ESP_GAP_SEARCH_SEARCH_CANCEL_CMPL_EVT: return "ESP_GAP_SEARCH_SEARCH_CANCEL_CMPL_EVT";
#endif
    default: log_v("Unknown event type: 0x%x", searchEvt); return "Unknown event type";
  }
}  // searchEventTypeToString

#endif  // CONFIG_BLUEDROID_ENABLED

/*****************************************************************************
 *                             NimBLE functions                              *
 *****************************************************************************/

#if defined(CONFIG_NIMBLE_ENABLED)

/**
 * @brief Construct a BLETaskData instance.
 * @param [in] pInstance An instance of the class that will be waiting.
 * @param [in] flags General purpose flags for the caller.
 * @param [in] buf A buffer for data.
 */
BLETaskData::BLETaskData(void *pInstance, int flags, void *buf) : m_pInstance{pInstance}, m_flags{flags}, m_pBuf{buf}, m_pHandle{xTaskGetCurrentTaskHandle()} {}

/**
 * @brief Destructor.
 */
BLETaskData::~BLETaskData() {}

/**
 * @brief A function for checking validity of connection parameters.
 * @param [in] params A pointer to the structure containing the parameters to check.
 * @return valid == 0 or error code.
 */
int BLEUtils::checkConnParams(ble_gap_conn_params *params) {
  /* Check connection interval min */
  if ((params->itvl_min < BLE_HCI_CONN_ITVL_MIN) || (params->itvl_min > BLE_HCI_CONN_ITVL_MAX)) {
    return BLE_ERR_INV_HCI_CMD_PARMS;
  }
  /* Check connection interval max */
  if ((params->itvl_max < BLE_HCI_CONN_ITVL_MIN) || (params->itvl_max > BLE_HCI_CONN_ITVL_MAX) || (params->itvl_max < params->itvl_min)) {
    return BLE_ERR_INV_HCI_CMD_PARMS;
  }

  /* Check connection latency */
  if (params->latency > BLE_HCI_CONN_LATENCY_MAX) {
    return BLE_ERR_INV_HCI_CMD_PARMS;
  }

  /* Check supervision timeout */
  if ((params->supervision_timeout < BLE_HCI_CONN_SPVN_TIMEOUT_MIN) || (params->supervision_timeout > BLE_HCI_CONN_SPVN_TIMEOUT_MAX)) {
    return BLE_ERR_INV_HCI_CMD_PARMS;
  }

  /* Check connection event length */
  if (params->min_ce_len > params->max_ce_len) {
    return BLE_ERR_INV_HCI_CMD_PARMS;
  }

