espressif/arduino-esp32/libraries/BLE/src/BLEUtils.cpp
    case BLE_GAP_EVENT_CONN_UPDATE:  //3
      return "BLE_GAP_EVENT_CONN_UPDATE";

    case BLE_GAP_EVENT_CONN_UPDATE_REQ:  //4
      return "BLE_GAP_EVENT_CONN_UPDATE_REQ";

    case BLE_GAP_EVENT_L2CAP_UPDATE_REQ:  //5
      return "BLE_GAP_EVENT_L2CAP_UPDATE_REQ";

    case BLE_GAP_EVENT_TERM_FAILURE:  //6
      return "BLE_GAP_EVENT_TERM_FAILURE";

    case BLE_GAP_EVENT_DISC:  //7
      return "BLE_GAP_EVENT_DISC";

    case BLE_GAP_EVENT_DISC_COMPLETE:  //8
      return "BLE_GAP_EVENT_DISC_COMPLETE";

    case BLE_GAP_EVENT_ADV_COMPLETE:  //9
      return "BLE_GAP_EVENT_ADV_COMPLETE";

    case BLE_GAP_EVENT_ENC_CHANGE:  //10
      return "BLE_GAP_EVENT_ENC_CHANGE";

    case BLE_GAP_EVENT_PASSKEY_ACTION:  //11
      return "BLE_GAP_EVENT_PASSKEY_ACTION";

    case BLE_GAP_EVENT_NOTIFY_RX:  //12
      return "BLE_GAP_EVENT_NOTIFY_RX";

    case BLE_GAP_EVENT_NOTIFY_TX:  //13
      return "BLE_GAP_EVENT_NOTIFY_TX";

    case BLE_GAP_EVENT_SUBSCRIBE:  //14
      return "BLE_GAP_EVENT_SUBSCRIBE";

    case BLE_GAP_EVENT_MTU:  //15
      return "BLE_GAP_EVENT_MTU";

    case BLE_GAP_EVENT_IDENTITY_RESOLVED:  //16
      return "BLE_GAP_EVENT_IDENTITY_RESOLVED";

    case BLE_GAP_EVENT_REPEAT_PAIRING:  //17
      return "BLE_GAP_EVENT_REPEAT_PAIRING";

    case BLE_GAP_EVENT_PHY_UPDATE_COMPLETE:  //18
      return "BLE_GAP_EVENT_PHY_UPDATE_COMPLETE";

    case BLE_GAP_EVENT_EXT_DISC:  //19
      return "BLE_GAP_EVENT_EXT_DISC";

    case BLE_GAP_EVENT_AUTHORIZE:  //32
      return "BLE_GAP_EVENT_AUTHORIZE";
#ifdef BLE_GAP_EVENT_PERIODIC_SYNC     // IDF 4.0 does not support these
    case BLE_GAP_EVENT_PERIODIC_SYNC:  //20
      return "BLE_GAP_EVENT_PERIODIC_SYNC";

    case BLE_GAP_EVENT_PERIODIC_REPORT:  //21
      return "BLE_GAP_EVENT_PERIODIC_REPORT";

    case BLE_GAP_EVENT_PERIODIC_SYNC_LOST:  //22
      return "BLE_GAP_EVENT_PERIODIC_SYNC_LOST";

    case BLE_GAP_EVENT_SCAN_REQ_RCVD:  //23
      return "BLE_GAP_EVENT_SCAN_REQ_RCVD";
#endif
    default: log_d("gapEventToString: Unknown event type %d 0x%.2x", eventType, eventType); return "Unknown event type";
  }
#else   // #if defined(CONFIG_NIMBLE_ENABLE_GAP_EVENT_CODE_TEXT)
  return "";
#endif  // #if defined(CONFIG_NIMBLE_ENABLE_GAP_EVENT_CODE_TEXT)
}  // gapEventToString

/**
 * @brief Convert characteristic properties into a string representation.
 * @param [in] prop Characteristic properties.
 * @return A string representation of characteristic properties.
 */
String BLEUtils::characteristicPropertiesToString(uint8_t prop) {
  String res = "broadcast: ";
  res += ((prop & BLE_GATT_CHR_PROP_BROADCAST) ? "1" : "0");
  res += ", read: ";
  res += ((prop & BLE_GATT_CHR_PROP_READ) ? "1" : "0");
  res += ", write_nr: ";
  res += ((prop & BLE_GATT_CHR_PROP_WRITE_NO_RSP) ? "1" : "0");
  res += ", write: ";
  res += ((prop & BLE_GATT_CHR_PROP_WRITE) ? "1" : "0");
  res += ", notify: ";
  res += ((prop & BLE_GATT_CHR_PROP_NOTIFY) ? "1" : "0");
  res += ", indicate: ";
  res += ((prop & BLE_GATT_CHR_PROP_INDICATE) ? "1" : "0");
  res += ", auth_sign_write: ";
  res += ((prop & BLE_GATT_CHR_PROP_AUTH_SIGN_WRITE) ? "1" : "0");
  res += ", extended: ";
  res += ((prop & BLE_GATT_CHR_PROP_EXTENDED) ? "1" : "0");
  return res;
}  // characteristicPropertiesToString

/**
 * @brief Blocks the calling task until released or timeout.
 * @param [in] taskData A pointer to the task data structure.
 * @param [in] timeout The time to wait in milliseconds.
 * @return True if the task completed, false if the timeout was reached.
 */
bool BLEUtils::taskWait(const BLETaskData &taskData, uint32_t timeout) {
  ble_npl_time_t ticks;
  if (timeout == BLE_NPL_TIME_FOREVER) {
    ticks = BLE_NPL_TIME_FOREVER;
  } else {
    ble_npl_time_ms_to_ticks(timeout, &ticks);
  }

  uint32_t notificationValue;
  xTaskNotifyWait(0, TASK_BLOCK_BIT, &notificationValue, 0);
  if (notificationValue & TASK_BLOCK_BIT) {
    return true;
  }

  return xTaskNotifyWait(0, TASK_BLOCK_BIT, nullptr, ticks) == pdTRUE;
}  // taskWait

/**
 * @brief Release a task.
 * @param [in] taskData A pointer to the task data structure.
 * @param [in] flags A return value to set in the task data structure.
 */
void BLEUtils::taskRelease(const BLETaskData &taskData, int flags) {
  taskData.m_flags = flags;
  if (taskData.m_pHandle != nullptr) {
    xTaskNotify(static_cast<TaskHandle_t>(taskData.m_pHandle), TASK_BLOCK_BIT, eSetBits);
  }
}  // taskRelease

#endif  // CONFIG_NIMBLE_ENABLED

#endif /* CONFIG_BLUEDROID_ENABLED || CONFIG_NIMBLE_ENABLED */
#endif /* SOC_BLE_SUPPORTED || CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE */
